Repository: Foreverlongdamai/pilot-assessment-AI-system
Catalog: src/PilotAssessment.Desktop/Strings/*/Resources.resw
Source language: en_us
Languages: zh_cn

# App_Name
source: Pilot Assessment System
zh_cn: 飞行员评估系统

# App_ExpertWorkspace
source: Expert model workspace
zh_cn: 专家模型工作区

# Common_Project
source: PROJECT
zh_cn: 项目

# Common_Session
source: SESSION
zh_cn: 会话

# Common_TaskScheme
source: TASK SCHEME
zh_cn: 任务方案

# Common_Backend
source: BACKEND
zh_cn: 后端

# Common_Autosave
source: STAGED EDITS
zh_cn: 暂存编辑

# Common_Run
source: RUN
zh_cn: 运行

# Common_Reconnect
source: Reconnect
zh_cn: 重新连接

# Common_New
source: New
zh_cn: 新建

# Common_Copy
source: Copy
zh_cn: 复制

# Common_Rename
source: Rename
zh_cn: 重命名

# Common_Archive
source: Archive
zh_cn: 归档

# Common_Find
source: Find
zh_cn: 查找

# Common_Group
source: Group
zh_cn: 分组

# Common_Tag
source: Tag
zh_cn: 标签

# Common_Tags
source: Tags
zh_cn: 标签

# Common_Sort
source: Sort
zh_cn: 排序

# Common_Lifecycle
source: Lifecycle
zh_cn: 生命周期

# Common_Active
source: Active
zh_cn: 启用

# Common_Inactive
source: Inactive
zh_cn: 停用

# Common_IncludeArchived
source: Include archived
zh_cn: 包括已归档项

# Common_Open
source: Open
zh_cn: 打开

# Common_Refresh
source: Refresh
zh_cn: 刷新

# Common_Reload
source: Reload
zh_cn: 重新载入

# Common_Reapply
source: Reapply
zh_cn: 重新应用

# Common_Retry
source: Retry
zh_cn: 重试

# Common_Cancel
source: Cancel
zh_cn: 取消

# Common_Continue
source: Continue
zh_cn: 继续

# Common_Description
source: Description
zh_cn: 说明

# Common_Documentation
source: Documentation
zh_cn: 文档

# Common_Identifier
source: Identifier
zh_cn: 标识符

# Common_Status
source: Status
zh_cn: 状态

# Common_Revision
source: Revision
zh_cn: 修订号

# Common_NoGroup
source: No group
zh_cn: 无分组

# Common_NoTags
source: No tags
zh_cn: 无标签

# A11y_ReconnectBackend
source: Reconnect backend
zh_cn: 重新连接后端

# A11y_SwitchLanguage
source: Switch interface language
zh_cn: 切换界面语言

# A11y_SwitchTheme
source: Switch application theme
zh_cn: 切换应用主题

# A11y_MainNavigation
source: Main expert workspace navigation
zh_cn: 专家工作区主导航

# Nav_Project
source: Project
zh_cn: 项目

# Nav_Sessions
source: Sessions
zh_cn: 会话

# Nav_ModelStudio
source: Model Studio
zh_cn: 模型设计器

# Nav_Runs
source: Runs
zh_cn: 评估运行

# Nav_Results
source: Results
zh_cn: 评估结果

# Nav_Library
source: Library
zh_cn: 组件库

# Nav_Diagnostics
source: Diagnostics
zh_cn: 诊断

# Shell_NoProject
source: No project
zh_cn: 未打开项目

# Shell_NoSession
source: No session
zh_cn: 未选择会话

# Shell_NoTaskScheme
source: No task scheme
zh_cn: 未选择任务方案

# Shell_Stopped
source: Stopped
zh_cn: 已停止

# Shell_Connecting
source: Connecting
zh_cn: 正在连接

# Shell_Ready
source: Ready
zh_cn: 就绪

# Shell_Unavailable
source: Unavailable
zh_cn: 不可用

# Shell_NoPendingChanges
source: No staged changes
zh_cn: 无暂存修改

# Shell_PendingChanges
source: Staged changes pending
zh_cn: 有待确认的暂存修改

# Shell_Saving
source: Staging
zh_cn: 正在暂存

# Shell_Saved
source: Staged in project
zh_cn: 已保存到系统模型

# Shell_OfflineRetry
source: Offline / Retry
zh_cn: 离线 / 可重试

# Shell_Conflict
source: Conflict
zh_cn: 发生冲突

# Shell_Blocked
source: Blocked
zh_cn: 操作受阻

# Shell_Idle
source: Idle
zh_cn: 空闲

# Shell_NoBackendDiagnostics
source: No backend diagnostics.
zh_cn: 暂无后端诊断信息。

# Theme_System
source: System
zh_cn: 跟随系统

# Theme_Light
source: Light
zh_cn: 浅色

# Theme_Dark
source: Dark
zh_cn: 深色

# Project_Title
source: Projects
zh_cn: 项目

# Project_Description
source: A managed project stores imported Session Bundles, runs, results and artifacts. Evidence, BN nodes and task schemes belong to this software copy's shared system model library.
zh_cn: 受管项目保存导入的 Session Bundle、运行、结果和 artifacts；Evidence、BN 节点与任务方案属于当前软件副本共享的系统模型库。

source: Project operation failed
zh_cn: 项目操作失败

source: Project status
zh_cn: 项目状态

# Project_Current
source: Current project
zh_cn: 当前项目

# Project_Close
source: Close project
zh_cn: 关闭项目

# Project_Create
source: Create managed project
zh_cn: 创建受管项目

source: Project name
zh_cn: 项目名称

# Project_StableId
source: Stable project ID
zh_cn: 稳定项目 ID

source: Project folder
zh_cn: 项目文件夹

# Project_FolderPlaceholder
source: Choose an empty folder or a new folder path
zh_cn: 选择空文件夹或新的文件夹路径

# Project_ChooseFolder
source: Choose folder
zh_cn: 选择文件夹

# Project_CreateAndOpen
source: Create and open
zh_cn: 创建并打开

# Project_OpenManaged
source: Open managed project
zh_cn: 打开受管项目

# Project_OpenDescription
source: Choose a folder that contains project.json and project.sqlite3. Opening does not copy or relocate it.
zh_cn: 选择包含 project.json 和 project.sqlite3 的文件夹。打开操作不会复制或移动该项目。

# Project_ChooseProjectFolder
source: Choose project folder
zh_cn: 选择项目文件夹

# Project_Recent
source: Recent projects
zh_cn: 最近项目

# Project_RecentDescription
source: These are local path shortcuts only. No project or Session data is duplicated here.
zh_cn: 这里只保存本地路径快捷方式，不会在此复制项目或 Session 数据。

# Session_Title
source: Sessions
zh_cn: 会话

# Session_Description
source: Inspect a canonical Session Bundle or a simulator raw export without changing it, then create a canonical revision in the current managed project. Missing modalities remain missing.
zh_cn: 在不改动外部数据的情况下检查标准 Session Bundle 或模拟器原始导出，再在当前受管项目中建立规范修订；缺失模态继续保持缺失。

source: Session operation failed
zh_cn: 会话操作失败

source: Session status
zh_cn: 会话状态

# Session_Workflow
source: 1. Inspect external source · 2. Import managed session
zh_cn: 1. 检查外部来源 · 2. 导入受管 Session

# Session_ExternalFolder
source: External source folder (never moved or modified)
zh_cn: 外部来源文件夹（绝不移动或修改）

# Session_ChooseBundlePlaceholder
source: Choose a Session data folder
zh_cn: 选择 Session 数据文件夹

# Session_ChooseBundle
source: Choose Session data
zh_cn: 选择 Session 数据

# Session_Inspect
source: Inspect
zh_cn: 检查

# Session_ImportManaged
source: Import to managed project
zh_cn: 导入受管项目

# Session_ManagedSessions
source: Managed sessions
zh_cn: 受管会话

# Session_SelectedRevision
source: Selected managed revision
zh_cn: 选中的受管修订

# Session_ManagedPath
source: Managed bundle path
zh_cn: 受管存储

# Session_IngestionArtifact
source: Ingestion readiness artifact
zh_cn: 导入就绪性产物

# Session_SyncArtifact
source: Synchronization report artifact
zh_cn: 时间同步报告产物

# Session_PathBoundary
source: The external source path above and this managed path are intentionally distinct. Product installation files never contain user Session data.
zh_cn: 上方外部来源路径与此受管路径有意保持分离。产品安装文件永远不会包含用户 Session 数据。

# Session_InputFamilies
source: Canonical input families
zh_cn: 规范输入族

# Session_InputFamiliesDescription
source: Visual scene, gaze, pilot camera, EEG and ECG remain first-class even when this Session declares them missing or export pending.
zh_cn: 视觉场景、眼动、飞行员相机、EEG 与 ECG 始终是一等输入，即使当前 Session 声明它们缺失或等待导出。

# Model_Title
source: Model Studio
zh_cn: 模型设计器

# Model_Subtitle
source: Global complete nodes · current task activation
zh_cn: 全局完整节点 · 当前任务启用关系

# Model_SearchA11y
source: Search model nodes
zh_cn: 搜索模型节点

# Model_SearchPlaceholder
source: Search nodes
zh_cn: 搜索节点

# Model_ViewModeA11y
source: Graph visibility mode
zh_cn: 图可见性模式

# Model_KindFilterA11y
source: Node kind filter
zh_cn: 节点类型筛选

# Model_ActivationFilterA11y
source: Activation filter
zh_cn: 启用状态筛选

# Model_GroupFilterA11y
source: Node group filter
zh_cn: 节点分组筛选

# Model_TagFilterA11y
source: Node tag filter
zh_cn: 节点标签筛选

# Model_NewNode
source: New node
zh_cn: 新建节点

# Model_NewRawInput
source: New Raw Input
zh_cn: 新建原始输入

# Model_NewEvidence
source: New Evidence
zh_cn: 新建 Evidence

# Model_NewBn
source: New BN node
zh_cn: 新建 BN 节点

# Model_OpenDetails
source: Open details
zh_cn: 打开详情

# Model_OpenDetailsA11y
source: Open selected node details
zh_cn: 打开所选节点详情

# Model_Activate
source: Activate
zh_cn: 启用

# Model_Deactivate
source: Deactivate
zh_cn: 停用

# Model_Paste
source: Paste
zh_cn: 粘贴

# Model_MultiSelect
source: Multi-select
zh_cn: 多选

# Model_MultiSelectA11y
source: Toggle multi-select
zh_cn: 切换多选模式

# Model_ClearSelection
source: Clear selection
zh_cn: 清除选择

# Model_GraphLoadFailed
source: Graph load failed
zh_cn: 模型图载入失败

# Model_ViewActiveOnly
source: Active only
zh_cn: 仅显示启用节点

# Model_ViewActiveInactive
source: Active + inactive
zh_cn: 启用 + 停用节点

# Model_ViewAll
source: All global nodes
zh_cn: 全部全局节点

# Model_KindAll
source: All node kinds
zh_cn: 全部节点类型

# Model_KindRaw
source: Raw Input
zh_cn: 原始输入

# Model_ActivationAll
source: All activation states
zh_cn: 全部启用状态

# Task_Title
source: Task schemes
zh_cn: 任务方案

# Task_Subtitle
source: Parallel task configurations; switching does not mutate the model.
zh_cn: 各任务配置并列存在；切换任务不会改写模型。

# Task_CreateA11y
source: Create task scheme
zh_cn: 创建任务方案

# Task_CopyA11y
source: Copy selected task scheme
zh_cn: 复制所选任务方案

# Task_RenameA11y
source: Rename selected task scheme
zh_cn: 重命名所选任务方案

# Task_ArchiveA11y
source: Archive selected task scheme
zh_cn: 归档所选任务方案

# Task_SearchA11y
source: Search task schemes
zh_cn: 搜索任务方案

# Task_SearchPlaceholder
source: Search name, ID, tag or group
zh_cn: 搜索名称、ID、标签或分组

# Task_ListA11y
source: Task scheme list
zh_cn: 任务方案列表

# Task_AllGroups
source: All groups
zh_cn: 全部分组

# Task_AllTags
source: All tags
zh_cn: 全部标签

# Task_SortName
source: Name
zh_cn: 名称

# Task_SortUpdated
source: Recently updated
zh_cn: 最近更新

# Task_SortIdentifier
source: Identifier
zh_cn: 标识符

# Task_Archived
source: Archived
zh_cn: 已归档

# Task_NoGroupTags
source: No group or tags
zh_cn: 无分组或标签

# Task_StatusLine
source: {0} · rev {1} · {2} active
zh_cn: {0} · 修订 {1} · {2} 个已启用

# Node_WindowTitle
source: {0} · Node Editor
zh_cn: {0} · 节点编辑器

# Node_DefaultTitle
source: Node Editor
zh_cn: 节点编辑器

# Node_Header
source: Node
zh_cn: 节点

# Node_IndependentEditor
source: Independent node editor
zh_cn: 独立节点编辑器

# Node_Context
source: Context
zh_cn: 上下文

# Node_TaskScheme
source: Task scheme
zh_cn: 任务方案

# Node_SharedUsage
source: Shared usage
zh_cn: 共享使用情况

# Node_WindowKey
source: Window key
zh_cn: 窗口键

# Node_TechnicalIdentity
source: Technical identity
zh_cn: 技术身份

# Node_NodeId
source: Node ID
zh_cn: 节点 ID

# Node_CanonicalDefinition
source: Backend draft definition
zh_cn: 后端草稿定义

# Node_TechnicalStatus
source: Technical status
zh_cn: 技术状态

# Node_SemanticRevision
source: Semantic revision
zh_cn: 语义修订号

# Node_LayoutRevision
source: Layout revision
zh_cn: 布局修订号

# Node_EditorSurface
source: Editor surface
zh_cn: 节点编辑区

# Node_UsedByOne
source: Used by 1 current task scheme
zh_cn: 当前被 1 个任务方案使用

# Node_UsedByMany
source: Used by {0} current task schemes
zh_cn: 当前被 {0} 个任务方案使用

# Node_KindRaw
source: RAW INPUT
zh_cn: 原始输入

# Node_KindBn
source: BN NODE
zh_cn: BN 节点

# Node_KindSubskill
source: BN · SUB-SKILL
zh_cn: BN · 子技能

# Node_KindCompetency
source: BN · COMPETENCY
zh_cn: BN · 综合能力

# Node_OutputSuffix
source: {0} · output
zh_cn: {0} · 输出节点

# Node_StatusActive
source: active
zh_cn: 已启用

# Node_StatusInactive
source: inactive
zh_cn: 已停用

# Node_StatusArchived
source: archived
zh_cn: 已归档

# Node_SavePending
source: Pending · staging scheduled
zh_cn: 待暂存 · 已安排写入

# Node_SaveSaving
source: Staging in project…
zh_cn: 正在暂存到项目…

# Node_SaveOffline
source: Offline · Retry available
zh_cn: 离线 · 可以重试

# Node_SaveConflict
source: Conflict · choose Reload or Reapply
zh_cn: 冲突 · 请选择重新载入或重新应用

# Node_SaveSaved
source: Staged in project · draft rev {0}
zh_cn: 已暂存到项目 · 草稿修订 {0}

# Node_ExplicitPending
source: {0} · explicit state/CPT commit pending
zh_cn: {0} · 状态/CPT 显式提交待完成

# Dialog_DeactivateTitle
source: Deactivate node?
zh_cn: 停用节点？

# Dialog_DeactivateDescription
source: Stopping a parent can also stop downstream nodes in this task scheme.
zh_cn: 停用父节点还可能停用当前任务方案中的下游节点。

# Dialog_CreateNodeTitle
source: Create complete node
zh_cn: 创建完整节点

# Diagnostics_Title
source: Diagnostics
zh_cn: 诊断

# Diagnostics_Description
source: The desktop communicates with one local Python sidecar over private stdin/stdout JSON-RPC. No network port is used.
zh_cn: 桌面端通过私有 stdin/stdout JSON-RPC 与一个本地 Python sidecar 通信，不监听任何网络端口。

# Diagnostics_StartupFailed
source: Backend startup failed
zh_cn: 后端启动失败

# Diagnostics_BackendState
source: Backend state
zh_cn: 后端状态

# Diagnostics_Runtime
source: Runtime
zh_cn: 运行环境

# Diagnostics_Stderr
source: stderr diagnostics
zh_cn: stderr 诊断信息

# Diagnostics_StderrA11y
source: Backend stderr diagnostics
zh_cn: 后端 stderr 诊断信息

# Node_IndependentDescription
source: This is an independent, non-modal editor window. The main graph remains interactive.
zh_cn: 这是一个独立的非模态编辑窗口；主模型图仍可继续操作。

# Node_NoEditorDescription
source: This node type does not yet have its complete editor surface.
zh_cn: 此节点类型尚未提供完整编辑界面。

# Model_ChooseTaskScheme
source: Choose a task scheme to load the global model graph.
zh_cn: 请选择一个任务方案以载入全局模型图。

# Model_NoNodeSelected
source: No node selected
zh_cn: 未选择节点

# Model_NodesSelected
source: {0} nodes selected
zh_cn: 已选择 {0} 个节点

# Dialog_DeactivateSafety
source: Continue sends the exact preview hash to the backend. Cancel sends no write. This never archives a global node.
zh_cn: 继续操作会把当前预览哈希原样提交给后端；取消不会发送写操作；此操作绝不会归档全局节点。

# Graph_SelectNode
source: Select node
zh_cn: 选择节点

# Graph_ToggleSelection
source: Add/remove from selection
zh_cn: 加入/移出当前选择

# Graph_OpenNodeDetails
source: Open node details
zh_cn: 打开节点详情

# Graph_ActivateTask
source: Activate in this task
zh_cn: 在当前任务中启用

# Graph_DeactivateTask
source: Deactivate from this task (Delete)
zh_cn: 从当前任务停用（Delete）

# Graph_CopyNode
source: Copy complete node
zh_cn: 复制完整节点

# Graph_PasteTask
source: Paste into current task
zh_cn: 粘贴到当前任务

# Graph_ConnectParent
source: Connect selected parent to this node
zh_cn: 把所选父节点连接到此节点

# Graph_RemoveParent
source: Remove selected parent from this node
zh_cn: 从此节点移除所选父节点

# Graph_OutputBadge
source: OUT
zh_cn: 输出

# Graph_ZoomOutA11y
source: Zoom out
zh_cn: 缩小

# Graph_ZoomInA11y
source: Zoom in
zh_cn: 放大

# Graph_Fit
source: Fit
zh_cn: 适应窗口

# Graph_EdgeLegend
source: EDGE LEGEND
zh_cn: 边图例

# Graph_ExtractionEdge
source: Raw data / extraction
zh_cn: 原始数据 / Evidence 提取

# Graph_ProbabilisticEdge
source: Probabilistic BN
zh_cn: 概率 BN 关系

# Graph_DimMeaning
source: Dim = not active in this task
zh_cn: 暗色 = 当前任务未启用

# Graph_PanHint
source: Drag blank canvas to pan
zh_cn: 按住空白画布拖动可平移视野

# Graph_Minimap
source: MINIMAP
zh_cn: 小地图

# Graph_NodeHelp
source: Press Enter to select this complete node. Open its context menu for task activation, copy, connection and editor commands.
zh_cn: 按 Enter 选择此完整节点；打开上下文菜单可执行任务激活、复制、连接和编辑器命令。

# Dialog_CreateNodeButton
source: Create node
zh_cn: 创建节点

# Dialog_CreateNodeDescription
source: The backend stores one complete node definition. Evidence and BN nodes begin incomplete so experts can configure them without generated Python code.
zh_cn: 后端保存一个完整节点定义。Evidence 与 BN 节点最初标记为不完整，专家无需生成 Python 代码即可继续配置。

# Dialog_NodeKind
source: Node kind
zh_cn: 节点类型

# Dialog_EnglishNameExample
source: e.g. Disturbance instrument scan
zh_cn: 例如 Disturbance instrument scan

# Dialog_RawModality
source: Raw modality
zh_cn: 原始模态

# Dialog_ModalityX
source: X — flight state
zh_cn: X — 飞行状态

# Dialog_ModalityU
source: U — control input
zh_cn: U — 控制输入

# Dialog_ModalityI
source: I — visual scene
zh_cn: I — 视觉场景

# Dialog_ModalityG
source: G — gaze
zh_cn: G — 眼动注视

# Dialog_ModalityCamera
source: Pilot camera
zh_cn: 飞行员相机

# Editor_SelectOperatorParameters
source: Select an installed operator node to edit its schema-driven parameters.
zh_cn: 选择一个已安装算子节点，以编辑由 schema 驱动的参数。

# Editor_General
source: General
zh_cn: 常规

# Editor_TagsSeparated
source: Tags (comma/newline separated)
zh_cn: 标签（逗号或换行分隔）

# Editor_Help
source: Help
zh_cn: 帮助

# Raw_ContractDescription
source: This node declares how one managed Session Bundle resource is exposed to Evidence recipes. Ordinary fields are staged in the durable backend edit session after 350 ms; the canonical model changes only when Save all is chosen.
zh_cn: 此节点声明如何向 Evidence 配方暴露一项受管 Session Bundle 资源。常规字段会在 350 毫秒后暂存到后端持久化编辑会话；只有选择“保存全部”才会修改正式模型。

# Raw_ContractTitle
source: Raw Input contract editor
zh_cn: 原始输入契约编辑器

# Raw_InputFamily
source: Input family
zh_cn: 输入族

# Raw_ResourceRole
source: Resource role
zh_cn: 资源角色

# Raw_SourceSchema
source: Source & schema
zh_cn: 来源与 Schema

# Raw_SourceId
source: Source ID
zh_cn: 来源 ID

# Raw_SourceKind
source: Source kind
zh_cn: 来源类型

# Raw_SourceName
source: Source name
zh_cn: 来源名称

# Raw_SourceDescription
source: Source description
zh_cn: 来源说明

# Raw_AdapterId
source: Adapter ID
zh_cn: 适配器 ID

# Raw_ProfileId
source: Profile ID
zh_cn: 配置档 ID

# Raw_ClockBinding
source: Clock binding
zh_cn: 时钟绑定

# Raw_SourceDependencies
source: Source dependencies (one per line)
zh_cn: 来源依赖（每行一个）

# Raw_FieldsJson
source: Fields JSON array
zh_cn: 字段 JSON 数组

# Raw_UnitsJson
source: Units JSON object
zh_cn: 单位 JSON 对象

# Raw_MetadataJson
source: Complete metadata JSON (unknown fields are preserved)
zh_cn: 完整元数据 JSON（保留未知字段）

# Raw_TypeClock
source: Type & clock
zh_cn: 类型与时钟

# Raw_ValueType
source: Value type
zh_cn: 值类型

# Raw_Cardinality
source: Cardinality
zh_cn: 基数

# Raw_TemporalSemantics
source: Temporal semantics
zh_cn: 时间语义

# Raw_Unit
source: Unit
zh_cn: 单位

# Raw_SessionAvailability
source: Session availability
zh_cn: Session 可用性

# Operator_CatalogA11y
source: Trusted operator catalog
zh_cn: 受信任算子目录

# Operator_ChooseInstalled
source: Choose an installed operator
zh_cn: 选择已安装算子

# Operator_AddA11y
source: Add selected operator to recipe
zh_cn: 把所选算子加入配方

# Operator_Add
source: Add operator
zh_cn: 添加算子

source: Operator nodes
zh_cn: 算子节点

# Operator_NodesA11y
source: Evidence recipe operator nodes
zh_cn: Evidence 配方算子节点

# Operator_RemoveA11y
source: Remove selected operator from recipe
zh_cn: 从配方移除所选算子

# Operator_Remove
source: Remove selected operator
zh_cn: 移除所选算子

# Operator_TypedEdges
source: Typed recipe edges
zh_cn: 类型化配方边

# Operator_TypedEdgesA11y
source: Evidence recipe typed edges
zh_cn: Evidence 配方类型化边

# Operator_RemoveEdgeA11y
source: Remove selected Evidence recipe edge
zh_cn: 移除所选 Evidence 配方边

# Operator_RemoveEdge
source: Remove selected edge
zh_cn: 移除所选边

# Operator_ConnectPorts
source: Connect declared operator ports
zh_cn: 连接已声明的算子端口

# Operator_SourceNodeId
source: Source node ID
zh_cn: 源节点 ID

# Operator_OutputPortId
source: Output port ID
zh_cn: 输出端口 ID

# Operator_TargetNodeId
source: Target node ID
zh_cn: 目标节点 ID

# Operator_InputPortId
source: Input port ID
zh_cn: 输入端口 ID

# Operator_OptionalSlotId
source: Optional slot ID
zh_cn: 可选插槽 ID

# Operator_ConnectA11y
source: Connect declared Evidence recipe ports
zh_cn: 连接已声明的 Evidence 配方端口

# Operator_Connect
source: Connect
zh_cn: 连接

# Evidence_CanonicalEditor
source: Evidence editor · staged draft
zh_cn: Evidence 编辑器 · 暂存草稿

# Evidence_OperatorUnavailable
source: Operator unavailable
zh_cn: 算子不可用

# Evidence_AnchorName
source: Anchor/evidence name
zh_cn: Anchor/Evidence 名称

# Evidence_AnchorDescription
source: Anchor/evidence description
zh_cn: Anchor/Evidence 说明

# Evidence_RecipeSummary
source: Recipe documentation summary
zh_cn: 配方文档摘要

# Evidence_RawBindings
source: Raw Input bindings
zh_cn: 原始输入绑定

# Evidence_FixedBindings
source: Fixed model bindings
zh_cn: 固定模型绑定

# Evidence_FixedBindingsDescription
source: Add/remove Raw Input extraction edges on the main graph. The backend migrates the complete recipe binding atomically.
zh_cn: 在主模型图上添加或移除原始输入提取边；后端会以原子事务迁移完整配方绑定。

# Evidence_RecipeOutputs
source: Recipe outputs
zh_cn: 配方输出

source: EvidenceRecipe graph
zh_cn: EvidenceRecipe 图

# Evidence_Parameters
source: Parameters
zh_cn: 参数

# Evidence_SchemaParameters
source: Schema-driven operator parameters
zh_cn: Schema 驱动的算子参数

# Evidence_SchemaParametersDescription
source: Select a recipe node in the EvidenceRecipe graph tab. Controls are generated from the backend OperatorDefinition schema and UI hints; unknown JSON is preserved read-only.
zh_cn: 请在 EvidenceRecipe 图标签页中选择配方节点。控件由后端 OperatorDefinition schema 与 UI 提示生成；未知 JSON 以只读方式保留。

# Evidence_ScoringTab
source: Windows / Aggregation / Scoring / D-A-U
zh_cn: 窗口 / 聚合 / 评分 / D-A-U

# Evidence_ScoringDescription
source: Windowing and aggregation are ordinary operator nodes in the typed recipe graph. Scoring and D-A-U mapping remain explicit typed JSON contracts.
zh_cn: 窗口与聚合是类型化配方图中的普通算子节点；评分和 D-A-U 映射仍是显式类型化 JSON 契约。

# Evidence_ScoringJson
source: Scoring contract JSON (blank means no scoring)
zh_cn: 评分契约 JSON（留空表示不评分）

# Evidence_ObservationMapping
source: Observation mapping JSON
zh_cn: 观测映射 JSON

# Evidence_ModalityWeights
source: Modality attribution weights JSON
zh_cn: 模态归因权重 JSON

# Evidence_ObservationStates
source: Observation states
zh_cn: 观测状态

# Evidence_ObservationPolicy
source: Observation policy
zh_cn: 观测策略

# Editor_AddState
source: Add state
zh_cn: 添加状态

# Editor_RemoveSelected
source: Remove selected
zh_cn: 移除所选项

# Editor_CommitStates
source: Commit states + mark affected CPTs incomplete
zh_cn: 提交状态并将受影响 CPT 标记为不完整

# Editor_StateTransactionDescription
source: One backend transaction updates this axis and every dependent CPT axis.
zh_cn: 一个后端事务会同时更新此轴和所有依赖 CPT 的对应轴。

# Editor_StateId
source: State ID
zh_cn: 状态 ID

# Editor_Label
source: Label
zh_cn: 标签名称

# Evidence_ProbabilisticParents
source: Probabilistic parents / CPT
zh_cn: 概率父节点 / CPT

# Evidence_ProbabilisticDescription
source: Evidence probabilistic parents are BN nodes. Add/remove/reorder those fixed edges on the main graph; its atomic migration dialog updates this same staged CPT. The complete row grid below is shared with BN nodes.
zh_cn: Evidence 的概率父节点是 BN 节点。在主模型图上添加、移除或重排这些固定边；原子迁移对话框会更新同一个暂存 CPT。下方完整行表格与 BN 节点共用。

# Evidence_CanonicalBnRelationship
source: Canonical BN relationship
zh_cn: 规范 BN 关系

# Editor_FixedParents
source: Fixed parents
zh_cn: 固定父节点

# Evidence_PreviewTrace
source: Preview / Trace
zh_cn: 预览 / 跟踪

# Evidence_PreviewDescription
source: Preview is requested from the Python backend for the selected managed session and current task. C# does not evaluate operators.
zh_cn: 预览由 Python 后端针对所选受管 Session 和当前任务计算；C# 不执行算子。

# Evidence_RequestPreview
source: Request backend preview
zh_cn: 请求后端预览

# Editor_UsedBySchemes
source: Used by schemes
zh_cn: 使用此节点的方案

# Editor_SharedImpact
source: Shared node impact
zh_cn: 共享节点影响

# Editor_SharedImpactDescription
source: This is one shared complete node. Choosing Save all commits the staged edit for future runs in every listed task scheme; historical RunSnapshots remain immutable.
zh_cn: 这是一个共享的完整节点。选择“保存全部”后，暂存修改会影响列出的所有任务方案的未来运行；历史 RunSnapshot 保持不可变。

# Editor_History
source: History
zh_cn: 历史

# Editor_HistoryDescription
source: Canonical change events are read from the backend audit/history journal.
zh_cn: 规范更改事件从后端审计/历史日志读取。

# Bn_CanonicalEditor
source: BN node editor · staged draft
zh_cn: BN 节点编辑器 · 暂存草稿

source: BN operation blocked
zh_cn: BN 操作受阻

source: BN node role
zh_cn: BN 节点角色

# Bn_ScientificStatus
source: Scientific status
zh_cn: 科学状态

# Bn_ReportingMetadata
source: Reporting metadata JSON
zh_cn: 报告元数据 JSON

# Bn_SaveBoundary
source: Save boundary
zh_cn: 保存边界

# Bn_SaveBoundaryDescription
source: General text and metadata are staged in the durable backend edit session after 350 ms. State, parent and CPT changes remain explicit atomic draft operations because they also migrate dependent probability tables. The canonical model changes only when Save all is chosen.
zh_cn: 常规文本和元数据会在 350 毫秒后暂存到后端持久化编辑会话。状态、父节点和 CPT 更改仍通过显式原子草稿操作完成，因为它们还会迁移依赖概率表。只有选择“保存全部”才会修改正式模型。

# Bn_ParentsChildren
source: Fixed parents / children
zh_cn: 固定父节点 / 子节点

# Bn_ParentDirection
source: Canonical direction: parent → child
zh_cn: 规范方向：父节点 → 子节点

# Bn_ParentDirectionDescription
source: Every visible BN node owns one fixed ordered parent list. Adding, removing or reordering a parent sends one backend operation that migrates the CPT axes atomically.
zh_cn: 每个可见 BN 节点都拥有一个固定有序父节点列表。添加、移除或重排父节点会发送一次后端操作，原子迁移 CPT 各轴。

# Bn_NewParent
source: New parent
zh_cn: 新父节点

# Bn_CptMigration
source: CPT migration
zh_cn: CPT 迁移

# Bn_AddParent
source: Add parent atomically
zh_cn: 原子添加父节点
